; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob53) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate13)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate8)
	(at pallet3 distributor0)
	(clear crate10)
	(at pallet4 distributor1)
	(clear crate15)
	(at pallet5 distributor2)
	(clear crate14)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 depot1)
	(clear crate12)
	(at pallet8 depot1)
	(clear crate2)
	(at truck0 depot1)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at hoist10 depot2)
	(available hoist10)
	(at hoist11 distributor0)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 depot1)
	(on crate1 pallet7)
	(at crate2 depot1)
	(on crate2 pallet8)
	(at crate3 depot1)
	(on crate3 crate1)
	(at crate4 depot2)
	(on crate4 pallet2)
	(at crate5 distributor2)
	(on crate5 crate0)
	(at crate6 depot1)
	(on crate6 crate3)
	(at crate7 depot1)
	(on crate7 crate6)
	(at crate8 depot2)
	(on crate8 crate4)
	(at crate9 distributor0)
	(on crate9 pallet3)
	(at crate10 distributor0)
	(on crate10 crate9)
	(at crate11 depot0)
	(on crate11 pallet0)
	(at crate12 depot1)
	(on crate12 crate7)
	(at crate13 depot0)
	(on crate13 crate11)
	(at crate14 distributor2)
	(on crate14 crate5)
	(at crate15 distributor1)
	(on crate15 pallet4)
)

(:goal (and
		(on crate0 pallet6)
		(on crate1 crate15)
		(on crate2 pallet0)
		(on crate3 crate12)
		(on crate4 crate2)
		(on crate5 pallet1)
		(on crate6 pallet4)
		(on crate7 crate3)
		(on crate9 crate5)
		(on crate10 pallet5)
		(on crate12 crate6)
		(on crate13 crate0)
		(on crate15 pallet8)
	)
))

; plan
1. (lift hoist2 crate8 crate4 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 crate4)
   added: (lifting hoist2 crate8) (clear crate4)
   goals met: 0 of 13
2. (lift hoist11 crate10 crate9 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist11) (on crate10 crate9)
   added: (lifting hoist11 crate10) (clear crate9)
   goals met: 0 of 13
3. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 0 of 13
4. (load hoist11 crate10 truck1 distributor0)
   deleted: (lifting hoist11 crate10)
   added: (in crate10 truck1) (available hoist11)
   goals met: 0 of 13
5. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 0 of 13
6. (lift hoist1 crate12 crate7 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate7)
   added: (lifting hoist1 crate12) (clear crate7)
   goals met: 0 of 13
7. (lift hoist8 crate13 crate11 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist8) (on crate13 crate11)
   added: (lifting hoist8 crate13) (clear crate11)
   goals met: 0 of 13
8. (lift hoist6 crate2 pallet8 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist6) (on crate2 pallet8)
   added: (lifting hoist6 crate2) (clear pallet8)
   goals met: 0 of 13
9. (load hoist6 crate2 truck0 depot1)
   deleted: (lifting hoist6 crate2)
   added: (in crate2 truck0) (available hoist6)
   goals met: 0 of 13
10. (lift hoist9 crate4 pallet2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist9) (on crate4 pallet2)
   added: (lifting hoist9 crate4) (clear pallet2)
   goals met: 0 of 13
11. (lift hoist3 crate9 pallet3 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 pallet3)
   added: (lifting hoist3 crate9) (clear pallet3)
   goals met: 0 of 13
12. (lift hoist12 crate7 crate6 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist12) (on crate7 crate6)
   added: (lifting hoist12 crate7) (clear crate6)
   goals met: 0 of 13
13. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 0 of 13
14. (load hoist8 crate13 truck0 depot0)
   deleted: (lifting hoist8 crate13)
   added: (in crate13 truck0) (available hoist8)
   goals met: 0 of 13
15. (unload hoist8 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 0 of 13
16. (lift hoist0 crate11 pallet0 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 pallet0)
   added: (lifting hoist0 crate11) (clear pallet0)
   goals met: 0 of 13
17. (drop hoist8 crate2 pallet0 depot0)
   deleted: (lifting hoist8 crate2) (clear pallet0)
   added: (available hoist8) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 1 of 13
18. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 1 of 13
19. (load hoist9 crate4 truck0 depot2)
   deleted: (lifting hoist9 crate4)
   added: (in crate4 truck0) (available hoist9)
   goals met: 1 of 13
20. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 1 of 13
21. (unload hoist8 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist8)
   added: (lifting hoist8 crate4)
   goals met: 1 of 13
22. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 13
23. (load hoist3 crate9 truck0 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck0) (available hoist3)
   goals met: 1 of 13
24. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 1 of 13
25. (drop hoist8 crate4 crate2 depot0)
   deleted: (lifting hoist8 crate4) (clear crate2)
   added: (available hoist8) (at crate4 depot0) (clear crate4) (on crate4 crate2)
   goals met: 2 of 13
26. (lift hoist7 crate15 pallet4 distributor1)
   deleted: (at crate15 distributor1) (clear crate15) (available hoist7) (on crate15 pallet4)
   added: (lifting hoist7 crate15) (clear pallet4)
   goals met: 2 of 13
27. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 2 of 13
28. (load hoist7 crate15 truck0 distributor1)
   deleted: (lifting hoist7 crate15)
   added: (in crate15 truck0) (available hoist7)
   goals met: 2 of 13
29. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 2 of 13
30. (drop hoist1 crate12 crate6 depot1)
   deleted: (lifting hoist1 crate12) (clear crate6)
   added: (available hoist1) (at crate12 depot1) (clear crate12) (on crate12 crate6)
   goals met: 3 of 13
31. (unload hoist6 crate15 truck0 depot1)
   deleted: (in crate15 truck0) (available hoist6)
   added: (lifting hoist6 crate15)
   goals met: 3 of 13
32. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 3 of 13
33. (drop hoist6 crate15 pallet8 depot1)
   deleted: (lifting hoist6 crate15) (clear pallet8)
   added: (available hoist6) (at crate15 depot1) (clear crate15) (on crate15 pallet8)
   goals met: 4 of 13
34. (lift hoist1 crate12 crate6 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist1) (on crate12 crate6)
   added: (lifting hoist1 crate12) (clear crate6)
   goals met: 3 of 13
35. (lift hoist6 crate6 crate3 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist6) (on crate6 crate3)
   added: (lifting hoist6 crate6) (clear crate3)
   goals met: 3 of 13
36. (drop hoist1 crate12 pallet1 depot1)
   deleted: (lifting hoist1 crate12) (clear pallet1)
   added: (available hoist1) (at crate12 depot1) (clear crate12) (on crate12 pallet1)
   goals met: 3 of 13
37. (drop hoist12 crate7 crate3 depot1)
   deleted: (lifting hoist12 crate7) (clear crate3)
   added: (available hoist12) (at crate7 depot1) (clear crate7) (on crate7 crate3)
   goals met: 4 of 13
38. (lift hoist12 crate12 pallet1 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist12) (on crate12 pallet1)
   added: (lifting hoist12 crate12) (clear pallet1)
   goals met: 4 of 13
39. (drop hoist6 crate6 pallet1 depot1)
   deleted: (lifting hoist6 crate6) (clear pallet1)
   added: (available hoist6) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 4 of 13
40. (drop hoist12 crate12 crate6 depot1)
   deleted: (lifting hoist12 crate12) (clear crate6)
   added: (available hoist12) (at crate12 depot1) (clear crate12) (on crate12 crate6)
   goals met: 5 of 13
41. (lift hoist6 crate7 crate3 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist6) (on crate7 crate3)
   added: (lifting hoist6 crate7) (clear crate3)
   goals met: 4 of 13
42. (lift hoist12 crate3 crate1 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist12) (on crate3 crate1)
   added: (lifting hoist12 crate3) (clear crate1)
   goals met: 4 of 13
43. (drop hoist12 crate3 crate12 depot1)
   deleted: (lifting hoist12 crate3) (clear crate12)
   added: (available hoist12) (at crate3 depot1) (clear crate3) (on crate3 crate12)
   goals met: 5 of 13
44. (lift hoist12 crate1 pallet7 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist12) (on crate1 pallet7)
   added: (lifting hoist12 crate1) (clear pallet7)
   goals met: 5 of 13
45. (drop hoist12 crate1 crate15 depot1)
   deleted: (lifting hoist12 crate1) (clear crate15)
   added: (available hoist12) (at crate1 depot1) (clear crate1) (on crate1 crate15)
   goals met: 6 of 13
46. (lift hoist1 crate3 crate12 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 crate12)
   added: (lifting hoist1 crate3) (clear crate12)
   goals met: 5 of 13
47. (drop hoist1 crate3 pallet7 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet7)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet7)
   goals met: 5 of 13
48. (lift hoist12 crate12 crate6 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist12) (on crate12 crate6)
   added: (lifting hoist12 crate12) (clear crate6)
   goals met: 4 of 13
49. (lift hoist1 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   goals met: 4 of 13
50. (drop hoist6 crate7 crate1 depot1)
   deleted: (lifting hoist6 crate7) (clear crate1)
   added: (available hoist6) (at crate7 depot1) (clear crate7) (on crate7 crate1)
   goals met: 4 of 13
51. (drop hoist1 crate6 pallet1 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 4 of 13
52. (lift hoist6 crate3 pallet7 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist6) (on crate3 pallet7)
   added: (lifting hoist6 crate3) (clear pallet7)
   goals met: 4 of 13
53. (drop hoist12 crate12 pallet7 depot1)
   deleted: (lifting hoist12 crate12) (clear pallet7)
   added: (available hoist12) (at crate12 depot1) (clear crate12) (on crate12 pallet7)
   goals met: 4 of 13
54. (drop hoist6 crate3 crate12 depot1)
   deleted: (lifting hoist6 crate3) (clear crate12)
   added: (available hoist6) (at crate3 depot1) (clear crate3) (on crate3 crate12)
   goals met: 5 of 13
55. (lift hoist6 crate7 crate1 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist6) (on crate7 crate1)
   added: (lifting hoist6 crate7) (clear crate1)
   goals met: 5 of 13
56. (lift hoist12 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist12) (on crate6 pallet1)
   added: (lifting hoist12 crate6) (clear pallet1)
   goals met: 5 of 13
57. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 5 of 13
58. (load hoist12 crate6 truck0 depot1)
   deleted: (lifting hoist12 crate6)
   added: (in crate6 truck0) (available hoist12)
   goals met: 5 of 13
59. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 5 of 13
60. (unload hoist7 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist7)
   added: (lifting hoist7 crate6)
   goals met: 5 of 13
61. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 5 of 13
62. (drop hoist7 crate6 pallet4 distributor1)
   deleted: (lifting hoist7 crate6) (clear pallet4)
   added: (available hoist7) (at crate6 distributor1) (clear crate6) (on crate6 pallet4)
   goals met: 6 of 13
63. (lift hoist5 crate14 crate5 distributor2)
   deleted: (at crate14 distributor2) (clear crate14) (available hoist5) (on crate14 crate5)
   added: (lifting hoist5 crate14) (clear crate5)
   goals met: 6 of 13
64. (load hoist5 crate14 truck1 distributor2)
   deleted: (lifting hoist5 crate14)
   added: (in crate14 truck1) (available hoist5)
   goals met: 6 of 13
65. (lift hoist5 crate5 crate0 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate0)
   added: (lifting hoist5 crate5) (clear crate0)
   goals met: 6 of 13
66. (load hoist5 crate5 truck1 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck1) (available hoist5)
   goals met: 6 of 13
67. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 6 of 13
68. (unload hoist12 crate5 truck1 depot1)
   deleted: (in crate5 truck1) (available hoist12)
   added: (lifting hoist12 crate5)
   goals met: 6 of 13
69. (drop hoist12 crate5 pallet1 depot1)
   deleted: (lifting hoist12 crate5) (clear pallet1)
   added: (available hoist12) (at crate5 depot1) (clear crate5) (on crate5 pallet1)
   goals met: 7 of 13
70. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 7 of 13
71. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 7 of 13
72. (unload hoist12 crate9 truck0 depot1)
   deleted: (in crate9 truck0) (available hoist12)
   added: (lifting hoist12 crate9)
   goals met: 7 of 13
73. (drop hoist12 crate9 crate5 depot1)
   deleted: (lifting hoist12 crate9) (clear crate5)
   added: (available hoist12) (at crate9 depot1) (clear crate9) (on crate9 crate5)
   goals met: 8 of 13
74. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   goals met: 8 of 13
75. (drop hoist5 crate0 pallet6 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet6)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet6)
   goals met: 9 of 13
76. (unload hoist5 crate10 truck1 distributor2)
   deleted: (in crate10 truck1) (available hoist5)
   added: (lifting hoist5 crate10)
   goals met: 9 of 13
77. (drop hoist5 crate10 pallet5 distributor2)
   deleted: (lifting hoist5 crate10) (clear pallet5)
   added: (available hoist5) (at crate10 distributor2) (clear crate10) (on crate10 pallet5)
   goals met: 10 of 13
78. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 10 of 13
79. (unload hoist5 crate13 truck0 distributor2)
   deleted: (in crate13 truck0) (available hoist5)
   added: (lifting hoist5 crate13)
   goals met: 10 of 13
80. (drop hoist5 crate13 crate0 distributor2)
   deleted: (lifting hoist5 crate13) (clear crate0)
   added: (available hoist5) (at crate13 distributor2) (clear crate13) (on crate13 crate0)
   goals met: 11 of 13
81. (lift hoist1 crate3 crate12 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 crate12)
   added: (lifting hoist1 crate3) (clear crate12)
   goals met: 10 of 13
82. (drop hoist1 crate3 crate9 depot1)
   deleted: (lifting hoist1 crate3) (clear crate9)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 crate9)
   goals met: 10 of 13
83. (lift hoist12 crate12 pallet7 depot1)
   deleted: (at crate12 depot1) (clear crate12) (available hoist12) (on crate12 pallet7)
   added: (lifting hoist12 crate12) (clear pallet7)
   goals met: 10 of 13
84. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 10 of 13
85. (load hoist12 crate12 truck0 depot1)
   deleted: (lifting hoist12 crate12)
   added: (in crate12 truck0) (available hoist12)
   goals met: 10 of 13
86. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 10 of 13
87. (unload hoist7 crate12 truck0 distributor1)
   deleted: (in crate12 truck0) (available hoist7)
   added: (lifting hoist7 crate12)
   goals met: 10 of 13
88. (drop hoist7 crate12 crate6 distributor1)
   deleted: (lifting hoist7 crate12) (clear crate6)
   added: (available hoist7) (at crate12 distributor1) (clear crate12) (on crate12 crate6)
   goals met: 11 of 13
89. (lift hoist12 crate3 crate9 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist12) (on crate3 crate9)
   added: (lifting hoist12 crate3) (clear crate9)
   goals met: 11 of 13
90. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 11 of 13
91. (load hoist12 crate3 truck0 depot1)
   deleted: (lifting hoist12 crate3)
   added: (in crate3 truck0) (available hoist12)
   goals met: 11 of 13
92. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 11 of 13
93. (unload hoist7 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist7)
   added: (lifting hoist7 crate3)
   goals met: 11 of 13
94. (drop hoist7 crate3 crate12 distributor1)
   deleted: (lifting hoist7 crate3) (clear crate12)
   added: (available hoist7) (at crate3 distributor1) (clear crate3) (on crate3 crate12)
   goals met: 12 of 13
95. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 12 of 13
96. (load hoist6 crate7 truck0 depot1)
   deleted: (lifting hoist6 crate7)
   added: (in crate7 truck0) (available hoist6)
   goals met: 12 of 13
97. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 12 of 13
98. (unload hoist7 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist7)
   added: (lifting hoist7 crate7)
   goals met: 12 of 13
99. (drop hoist7 crate7 crate3 distributor1)
   deleted: (lifting hoist7 crate7) (clear crate3)
   added: (available hoist7) (at crate7 distributor1) (clear crate7) (on crate7 crate3)
   goals met: 13 of 13
